#ifndef __GPIO_FUNATION_H
#define __GPIO_FUNATION_H

#define PA0_MoShi 1   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PA1_MoShi 1   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PA2_MoShi 7   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PA3_MoShi 1   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PA4_MoShi 1   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PA5_MoShi 1   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PA6_MoShi 1   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PA7_MoShi 2   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PA8_MoShi 2   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PA9_MoShi 7   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PA10_MoShi 1   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PA11_MoShi 1   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PA12_MoShi 7   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PA13_MoShi 2   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PA14_MoShi 5   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PA15_MoShi 1   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出

#define PB0_MoShi 2   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PB1_MoShi 2   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PB2_MoShi 2   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PB3_MoShi 5   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PB4_MoShi 5   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PB5_MoShi 2   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PB6_MoShi 5   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PB7_MoShi 2   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PB8_MoShi 2   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PB9_MoShi 2   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PB10_MoShi 2   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PB11_MoShi 5   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PB12_MoShi 5   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PB13_MoShi 5   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PB14_MoShi 5   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PB15_MoShi 5   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出

#define PC0_MoShi 5   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PC1_MoShi 1   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PC2_MoShi 1   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PC3_MoShi 1   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PC4_MoShi 1   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PC5_MoShi 2   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PC6_MoShi 5   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PC7_MoShi 5   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PC8_MoShi 5   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PC9_MoShi 5   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PC10_MoShi 5   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PC11_MoShi 5   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PC12_MoShi 5   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PC13_MoShi 2   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PC14_MoShi 2   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PC15_MoShi 2   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出

#define PD0_MoShi 1   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PD1_MoShi 1   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PD2_MoShi 5   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PD3_MoShi 1   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PD4_MoShi 1   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PD5_MoShi 1   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PD6_MoShi 1   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PD7_MoShi 1   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PD8_MoShi 1   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PD9_MoShi 1   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PD10_MoShi 1   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PD11_MoShi 1   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PD12_MoShi 1   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PD13_MoShi 1   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PD14_MoShi 1   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出
#define PD15_MoShi 1   	//0模拟输入,1浮空输入,2下拉输入,3上拉输入,4开漏输出,5推挽输出,6复用开漏输出,7复用推挽输出

void GPIO_Init_PeiZhi(void);

#endif
